// Задача №1. Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
/*
void Palindrom(int num)
{
    int firstNum = num / 10000;
    int lastNum = num % 10;
   
    
    if(num < 10000 | num > 99999)
    {
        Console.WriteLine(" ggg ");
    }
    
    else
    {
        if (firstNum == lastNum)
        {
            firstNum = firstNum / (10000/10);
            lastNum %= 10;
        }
    
    }
    
}

Console.Write("Input number ");
int a = Convert.ToInt32(Console.ReadLine());

Palindrom(a);
*/


