// Задача №1. Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
/*
int Amount(int amountNum)
{
    int count = 0;

    for(int i = 1; i <= amountNum; i++)
    {
        Console.Write($"Введите {i} число ");
        int number = Convert.ToInt32(Console.ReadLine());
        if(number > 0) count++;
    }
    return count;
}
Console.Write("Какое количество чисел будем проверять? ");
int amount = Convert.ToInt32(Console.ReadLine());

Console.WriteLine($" Количество чисел больше нуля = {Amount(amount)}");
*/

// Задача №2. Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем.
/*
int IntersectionPoint()*/